In [1]:
pip install pyodbc

Requirement already satisfied: pyodbc in c:\users\e_kur\anaconda3\lib\site-packages (4.0.0-unsupported)
Note: you may need to restart the kernel to use updated packages.

In [65]:
import pyodbc
import pandas as pd

In [2]:
def create_server_connection(driver, server, database, user, password):
    conn = None
    try:
        conn = pyodbc.connect(DRIVER = driver, SERVER = server, DATABASE = database, UID = user, PWD = password)
        print("MS SQL Server Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")
    return conn

In [63]:
driver = '{ODBC Driver 17 for SQL Server}'
server = 'VAIO'
database = 'master'
user = 'sa'
password = '14531453'
conn = create_server_connection(driver, server, database, user, password)

MS SQL Server Database connection successful

In [4]:
conn.autocommit = True

In [14]:
def create_database(conn, create_database_query):
    csr = conn.cursor()
    try:
        csr.execute(create_database_query)
        print("Database created successfully")
    except Error as err:
        print(f"Error: '{err}'")

In [13]:
create_database_query = 'CREATE DATABASE Test_DB'
create_database(conn, create_database_query)

Database created successfully

In [15]:
def execute_query(conn, query):
    csr = conn.cursor()
    try:
        csr.execute(query)
        conn.commit()
        print("Query successful")
    
    except Error as err:
        print(f"Error: '{err}'")

In [8]:
query ='USE Test_DB'

In [16]:
execute_query(conn, query)

Query successful

In [46]:
query = 'CREATE TABLE TestA ( \
             ID int IDENTITY(1,1) NOT NULL, \
             FirstName varchar(255) NOT NULL, \
             LastName varchar(255) NOT NULL, \
             PRIMARY KEY(ID))'
execute_query(conn, query)

Query successful

In [17]:
csr = conn.cursor()

In [27]:
csr.execute("INSERT TestA (FirstName, LastName) VALUES ('Aaaa', 'Bbbb')")
conn.commit()

In [28]:
csr.execute("INSERT TestA (FirstName, LastName) VALUES ('Bruce', 'Lee')")
conn.commit()

In [29]:
csr.execute("INSERT TestA (FirstName, LastName) VALUES ('Bob', 'Marley')")
conn.commit()

In [30]:
csr.execute("INSERT TestA (FirstName, LastName) VALUES ('Mel', 'Gibson')")
conn.commit()

In [31]:
csr.execute("INSERT TestA (FirstName, LastName) VALUES (?, ?)", 'Tom', 'Cat')
csr.execute("INSERT TestA (FirstName, LastName) VALUES (?, ?)", 'Jerry', 'Mouse')
csr.execute("INSERT TestA (FirstName, LastName) VALUES (?, ?)", 'Stefan', 'Müller')
csr.execute("INSERT TestA (FirstName, LastName) VALUES (?, ?)", 'Dennis', 'Bergkamp')

In [54]:
csr.execute("delete from TestA where FirstName = ?", 'Aaaa')

In [14]:
conn.commit()

In [37]:
print(csr.rowcount, 'row(s) deleted')

1 row(s) deleted

In [38]:
deleted = csr.execute("delete from TestA where FirstName = 'Cccc'").rowcount

In [39]:
conn.commit()

In [40]:
print(deleted, 'row(s) deleted')

0 row(s) deleted

In [41]:
csr = conn.cursor()
csr.execute('SELECT FirstName, LastName FROM TestA')
row = csr.fetchone()
if row:
    print(row)

('Bruce', 'Lee')

In [42]:
row.FirstName

'Bruce'

In [43]:
row.LastName

'Lee'

In [44]:
print("LastName: ", row.LastName)

LastName:  Lee

In [45]:
csr.execute('SELECT FirstName, LastName FROM TestA')
while True:
    row = csr.fetchone()
    if not row:
        break
    print('FirstName:', row.FirstName)

FirstName: Bruce
FirstName: Bob
FirstName: Bob
FirstName: Mel
FirstName: Aaaa
FirstName: Bruce
FirstName: Bob
FirstName: Mel
FirstName: Aaaa
FirstName: Bruce
FirstName: Bob
FirstName: Mel
FirstName: Aaaa
FirstName: Bruce
FirstName: Bob
FirstName: Mel
FirstName: Tom
FirstName: Jerry
FirstName: Stefan
FirstName: Dennis

In [46]:
csr.execute('SELECT ID, FirstName, LastName FROM TestA')
while True:
    row = csr.fetchone()
    if not row:
        break
    print(row.ID,row.FirstName,row.LastName)

4 Bruce Lee
5 Bob Marley
6 Bob Marley
7 Mel Gibson
8 Aaaa Bbbb
9 Bruce Lee
10 Bob Marley
11 Mel Gibson
12 Aaaa Bbbb
13 Bruce Lee
14 Bob Marley
15 Mel Gibson
16 Aaaa Bbbb
17 Bruce Lee
18 Bob Marley
19 Mel Gibson
20 Tom Cat
21 Jerry Mouse
22 Stefan Müller
23 Dennis Bergkamp

In [47]:
csr.execute('SELECT ID, FirstName, LastName FROM TestA')
rows = csr.fetchall()
rows

[(4, 'Bruce', 'Lee'),
 (5, 'Bob', 'Marley'),
 (6, 'Bob', 'Marley'),
 (7, 'Mel', 'Gibson'),
 (8, 'Aaaa', 'Bbbb'),
 (9, 'Bruce', 'Lee'),
 (10, 'Bob', 'Marley'),
 (11, 'Mel', 'Gibson'),
 (12, 'Aaaa', 'Bbbb'),
 (13, 'Bruce', 'Lee'),
 (14, 'Bob', 'Marley'),
 (15, 'Mel', 'Gibson'),
 (16, 'Aaaa', 'Bbbb'),
 (17, 'Bruce', 'Lee'),
 (18, 'Bob', 'Marley'),
 (19, 'Mel', 'Gibson'),
 (20, 'Tom', 'Cat'),
 (21, 'Jerry', 'Mouse'),
 (22, 'Stefan', 'Müller'),
 (23, 'Dennis', 'Bergkamp')]

In [48]:
csr.execute("""SELECT ID, FirstName, LastName 
            FROM TestA""")
rows = csr.fetchall()
rows

[(4, 'Bruce', 'Lee'),
 (5, 'Bob', 'Marley'),
 (6, 'Bob', 'Marley'),
 (7, 'Mel', 'Gibson'),
 (8, 'Aaaa', 'Bbbb'),
 (9, 'Bruce', 'Lee'),
 (10, 'Bob', 'Marley'),
 (11, 'Mel', 'Gibson'),
 (12, 'Aaaa', 'Bbbb'),
 (13, 'Bruce', 'Lee'),
 (14, 'Bob', 'Marley'),
 (15, 'Mel', 'Gibson'),
 (16, 'Aaaa', 'Bbbb'),
 (17, 'Bruce', 'Lee'),
 (18, 'Bob', 'Marley'),
 (19, 'Mel', 'Gibson'),
 (20, 'Tom', 'Cat'),
 (21, 'Jerry', 'Mouse'),
 (22, 'Stefan', 'Müller'),
 (23, 'Dennis', 'Bergkamp')]

In [49]:
for row in rows:
    print(row.ID,row.FirstName,row.LastName)

4 Bruce Lee
5 Bob Marley
6 Bob Marley
7 Mel Gibson
8 Aaaa Bbbb
9 Bruce Lee
10 Bob Marley
11 Mel Gibson
12 Aaaa Bbbb
13 Bruce Lee
14 Bob Marley
15 Mel Gibson
16 Aaaa Bbbb
17 Bruce Lee
18 Bob Marley
19 Mel Gibson
20 Tom Cat
21 Jerry Mouse
22 Stefan Müller
23 Dennis Bergkamp

In [50]:
type(rows)

list

In [51]:
csr.execute("""SELECT ID, FirstName, LastName 
            FROM TestA
            WHERE FirstName = ? and LastName = ?""",['Mel','Gibson'])
rows = csr.fetchall()
rows

[(7, 'Mel', 'Gibson'),
 (11, 'Mel', 'Gibson'),
 (15, 'Mel', 'Gibson'),
 (19, 'Mel', 'Gibson')]

In [52]:
csr.execute("""SELECT ID, FirstName, LastName 
            FROM TestA
            WHERE FirstName = ? and LastName = ?""",['Mel','Gibson'])
rows = csr.fetchmany(4)
rows

[(7, 'Mel', 'Gibson'),
 (11, 'Mel', 'Gibson'),
 (15, 'Mel', 'Gibson'),
 (19, 'Mel', 'Gibson')]

In [53]:
csr.execute("""SELECT ID, FirstName, LastName 
            FROM TestA
            WHERE FirstName = ? and LastName = ?""",['Mel','Gibson'])
rows = csr.fetchmany(1)
rows

[(7, 'Mel', 'Gibson')]

In [54]:
csr.execute("""SELECT ID, FirstName, LastName 
            FROM TestA""")
rows = csr.fetchmany(2)
rows

[(4, 'Bruce', 'Lee'), (5, 'Bob', 'Marley')]

In [55]:
csr.execute("""SELECT ID, FirstName, LastName 
            FROM TestA""")
rows = csr.fetchmany(2) # csr.execute sorgusunu yeniden çalıştırdığımız için aynı değer, verir
rows

[(4, 'Bruce', 'Lee'), (5, 'Bob', 'Marley')]

In [56]:
csr.execute("""SELECT ID, FirstName, LastName 
            FROM TestA""")
rows = csr.fetchmany(3)
rows

[(4, 'Bruce', 'Lee'), (5, 'Bob', 'Marley'), (6, 'Bob', 'Marley')]

In [57]:
rows = csr.fetchmany(1) # csr.execute sorgusunu çalıştırmadığımız için cursor kaldığı yerden sonra istenilen kadar verdi.
rows

[(7, 'Mel', 'Gibson')]

In [58]:
def read_query(conn, query):
    csr = conn.cursor()
    results = None
    csr.execute(query)
    results = csr.fetchall()
    csr.close()
    del csr
    return results

In [ ]:
query = """SELECT ID, FirstName, LastName FROM TestA"""
results = read_query(conn, query)

In [60]:
rows = csr.fetchmany(2)
rows

[(8, 'Aaaa', 'Bbbb'), (9, 'Bruce', 'Lee')]

In [64]:
conn.close()

In [35]:
results

[(4, 'Bruce', 'Lee'),
 (5, 'Bob', 'Marley'),
 (6, 'Bob', 'Marley'),
 (7, 'Mel', 'Gibson'),
 (8, 'Aaaa', 'Bbbb'),
 (9, 'Bruce', 'Lee'),
 (10, 'Bob', 'Marley'),
 (11, 'Mel', 'Gibson'),
 (12, 'Aaaa', 'Bbbb'),
 (13, 'Bruce', 'Lee'),
 (14, 'Bob', 'Marley'),
 (15, 'Mel', 'Gibson'),
 (16, 'Aaaa', 'Bbbb'),
 (17, 'Bruce', 'Lee'),
 (18, 'Bob', 'Marley'),
 (19, 'Mel', 'Gibson'),
 (20, 'Tom', 'Cat'),
 (21, 'Jerry', 'Mouse'),
 (22, 'Stefan', 'Müller'),
 (23, 'Dennis', 'Bergkamp')]

In [73]:
csr = conn.cursor()

In [66]:
df_old = pd.DataFrame(results)

In [67]:
df_old

                         0
0          [4, Bruce, Lee]
1         [5, Bob, Marley]
2         [6, Bob, Marley]
3         [7, Mel, Gibson]
4          [8, Aaaa, Bbbb]
5          [9, Bruce, Lee]
6        [10, Bob, Marley]
7        [11, Mel, Gibson]
8         [12, Aaaa, Bbbb]
9         [13, Bruce, Lee]
10       [14, Bob, Marley]
11       [15, Mel, Gibson]
12        [16, Aaaa, Bbbb]
13        [17, Bruce, Lee]
14       [18, Bob, Marley]
15       [19, Mel, Gibson]
16          [20, Tom, Cat]
17      [21, Jerry, Mouse]
18    [22, Stefan, Müller]
19  [23, Dennis, Bergkamp]

In [69]:
from_db = []
for result in results:
    result = list(result)
    from_db.append(result)

In [70]:
from_db

[[4, 'Bruce', 'Lee'],
 [5, 'Bob', 'Marley'],
 [6, 'Bob', 'Marley'],
 [7, 'Mel', 'Gibson'],
 [8, 'Aaaa', 'Bbbb'],
 [9, 'Bruce', 'Lee'],
 [10, 'Bob', 'Marley'],
 [11, 'Mel', 'Gibson'],
 [12, 'Aaaa', 'Bbbb'],
 [13, 'Bruce', 'Lee'],
 [14, 'Bob', 'Marley'],
 [15, 'Mel', 'Gibson'],
 [16, 'Aaaa', 'Bbbb'],
 [17, 'Bruce', 'Lee'],
 [18, 'Bob', 'Marley'],
 [19, 'Mel', 'Gibson'],
 [20, 'Tom', 'Cat'],
 [21, 'Jerry', 'Mouse'],
 [22, 'Stefan', 'Müller'],
 [23, 'Dennis', 'Bergkamp']]

In [71]:
columns = ['ID', 'FirstName', 'LastName']
df = pd.DataFrame(from_db, columns=columns)
df

    ID FirstName  LastName
0    4     Bruce       Lee
1    5       Bob    Marley
2    6       Bob    Marley
3    7       Mel    Gibson
4    8      Aaaa      Bbbb
5    9     Bruce       Lee
6   10       Bob    Marley
7   11       Mel    Gibson
8   12      Aaaa      Bbbb
9   13     Bruce       Lee
10  14       Bob    Marley
11  15       Mel    Gibson
12  16      Aaaa      Bbbb
13  17     Bruce       Lee
14  18       Bob    Marley
15  19       Mel    Gibson
16  20       Tom       Cat
17  21     Jerry     Mouse
18  22    Stefan    Müller
19  23    Dennis  Bergkamp

In [72]:
csr = conn.cursor()

In [ ]:
csr.execute("select FirstName, LastName from TestA").fetchone()

In [ ]:
csr.execute("select FirstName, LastName from TestA").fetchall()

In [ ]:
csr.execute("select FirstName, LastName from TestA").fetchval()